Repository: common-repository/login-watchdog
Catalog: languages/login-watchdog-*.po
Languages: cs_cz

source: out of
cs_cz: z

source: Plugin records failed login attempts and in case of exceeding the setting number of failed attempts blocks all login attempts from that IP address. In the administration shows a list of failed records with detailed overview (username, IP address, geolocation data).
cs_cz: Plugin zaznamenává neúspěšné pokusy o přihlášení a v případě, že je překročen nastavený maximální počet neúspěšných pokusů, plugin zablokuje danou IP adresu. V administraci se zobrazuje seznam neúspěšných pokusů o přihlášení s detailním přehledem (uživatelské jméno, IP adresa, geolokační údaje).

source: James JkmAS Mejstrik
cs_cz: Jakub JkmAS Mejstřík

source: Number of attemps can not be empty and must be a number
cs_cz: Počet pokusů nemůže být nulový a musí mít číselnou hodnotu

source: Number of attemps must be between 1 and 10
cs_cz: Počet pokusů musí být mezi 1 a 10

source: Length of blocking IP addresses can not be empty and must be a number
cs_cz: Délka blokace IP adresy nemůže být nulová a musí mít číselnou hodnotu

source: Length of blocking IP addresses must be between 10 mins and 1 month (43200 mins)
cs_cz: Délka blokace IP adresy musí být mezi 10 minutami a 1 měsícem (43200 minut)

source: Maximum number of displayed records can not be empty and must be a number
cs_cz: Maximální počet zobrazených záznamů nemůže být nulový a musí být vyjádřen číselně.

source: Logs
cs_cz: Logy

source: Settings
cs_cz: Nastavení

source: The number of failed attempts
cs_cz: Počet neúspěšných pokusů

source: The number of failed login attempts, after which the IP address will be blocked.
cs_cz: Počet chybných přihlášení, po kterých se IP adresa zablokuje

source: Lockout lenght (in minutes)
cs_cz: Délka blokace (v minutách)

source: How long will be the address blocked (in minutes).
cs_cz: Jak dlouho bude daná adresa blokována (v minutách).

source: Maximum number of displayed records
cs_cz: Maximální počet zobrazených záznamů

source: Maximum number of displayed records in logs table.
cs_cz: Maximální počet zobrazených záznamů v tabulce s logy.

source: Records
cs_cz: Záznamy

source: Do you want to delete the database with records of failed login?
cs_cz: Chcete vymazat záznamy uložené v databázi?

source: rec. store in database.
cs_cz: záznamů uložených v databázi.

source: Delete all records
cs_cz: Smazat veškeré záznamy

source: Showing
cs_cz: Zobrazeno

source: Refresh
cs_cz: Obnovit

source: Username
cs_cz: Uživatelské jméno

source: Date
cs_cz: Datum

source: Country
cs_cz: Země

source: No. of failures
cs_cz: Počet pokusů

source: There is no record
cs_cz: Žádný záznam

source: Currently blocked
cs_cz: Aktuálně blokováno

source: blocked
cs_cz: blokováno

source: Remove
cs_cz: Odeber

source: Show on map
cs_cz: Zobrazit na mapě

source: Loading...
cs_cz: Načítám...

source: Made with <span style='color: #e14d43;'>&hearts;</span> by JkmAS
cs_cz: Vytvořil s <span style='color: #e14d43;'>&hearts;</span> JkmAS

source: Your IP address can not be identified, for a successful login you can not hide your ip address
cs_cz: Vaše IP adresa nebyla identifikována, pro úspěšné přihlášení nesmíte skrývat IP adresu

source: Logging in from your IP address is blocked, try it later
cs_cz: Přihlášení z vaší IP adresy je blokováno, zkuste to později
